Tekla Open API Reference for Tekla Structures 2025
RebarGroup.StirrupType Property
 The type of the stirrup. The options are:
STIRRUP_TYPE_POLYGONAL
STIRRUP_TYPE_SPIRAL
STIRRUP_TYPE_TAPERED_CURVED
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarGroup.RebarGroupStirrupTypeEnum StirrupType { get; set; }
Public Property StirrupType As RebarGroup.RebarGroupStirrupTypeEnum
	Get
	Set
Property Value
Type: RebarGroup.RebarGroupStirrupTypeEnum
See Also
Reference
RebarGroup Class
Tekla.Structures.Model Namespace